{"Lists/A-few-recommended-non-fiction-books":{"slug":"Lists/A-few-recommended-non-fiction-books","filePath":"Lists/A few recommended non-fiction books.md","title":"Recommended books","links":[],"tags":["lists","personal"],"content":"A few goods I would recommend, in no particular order. I hope this list grows to at least 1000 books one day. Note to my future self: categorize into topics!!\n\nGods, Graves and Scholars: An almost novelistic account of some of the most important archaeological discoveries of the 19th and 20th centuries. The book I recommend to anyone who wants to read about archaeology for the first time\nLittle History of Religion: Written by a former bishop, this is a beautiful description of the different religions of the world, equally enjoyable by atheists and believers. A book I normally recommend to many people and it never disappointed.\nSea people: The Puzzle of Polynesia: The Polynesians are one of my favourite civilizations. This is an introduction on the topic with a focus on how the Western world came to know them and discover many of their extraordinary feats.\nThe Mystery of Capital: I read this book to better understand the economy of Peru when I was traveling the country and marveled at the uncountable unfinished homes that were everywhere. Hernando de Soto provided me a framework to think about the economies of developing countries that has been very useful over the years.\n1491 An excellent book that made me understand better the Americas and the peoples that inhabit them. Before reading this I underestimated the complexity of the societies and civilizations that once peopled the Americas.\nThe Case Against Education If you see that the education system is failing but fail to articulate what is exactly happening, search no more. The title is misleading though: this is the most pro-Education book that one can read. It is just against the education system, two different (and one could dare to say, opposite) things.\nThe Dawn of Everything: It might be beating a strawman at some point, but it is a very readable introduction to many of the discoveries coming from archaeology in the last decades. I find it an excellent point of departure to go explore different worlds.\nFrom Peasants into Frenchmen: Up to quite advanced the 19th century (so in history terms, yesterday), you did not have to go to exotic islands or remote jungles) to find cultures and people very different from you. This book explains how the modern nation-state colonized the people who lived in the villages and towns with very little contact with the big cities in France, like Paris or Lyon. These people had to be taught that they were French and that they belonged to a country. This is a very (very) detailed description of how that happened and that abstains from moral judgements.\nFossil Future: This is a book that has grown on me over time. At first I was a bit dismissive of some of the arguments and I found it unfair at times. Now I think it is mostly correct, not only the scientific part but the moral framework he proposes.\nGalileo’s Middle Finger: Alice Dredger was a rationalist before the modern rationalists (LessWrong adjacent) were a thing. This book is a very compassionate story on how she joins forces with an intersexual person with the goal of changing some brutal medical practices that were popular until very recent.\nThe Dictator’s Handbook: This is a framework to think about politics, not only dictatorships but also democracies. Instead of thinking that governments are a single agent, we need to model them as concentric layers of different size and political power; the balance of these layers determines what sort of government we end up with.\nThe Identity Trap: A very compassionate explanation on why the ideas of the Identity Synthesis (a.k.a the woke ideology) became popular. In hindsight, I found the explanation from Hanania’s “The Origin of Woke” more convincing, but this one was a good philosophical complement and probably a better starting point if you feel mostly neutral about these ideas.\nIdeas: A History of Thought and Invention, from Fire to Freud: This is a vast book in scope, that discusses the most important ideas produced by humankind, starting with inventions like fire or the Palaeolithic art: mind that idea is defined very broadly. It might not contain a revolutionary new perspective but it covers so many cultural manifestations of so many cultures that it is impossible to read this and not ending with the feeling that one understands the world a bit better.\nInadequate Equilibria: Where and How Civilizations Get Stuck: I think Yudkowsky is just plainly wrong about the AI dangers, but he is also a very original thinker that when he speaks is better to listen. In inadequate equilibria he identifies at least 3 aspects that explains why civilizations get stuck for some reason or another.  This is a book that any Austrian economist could appreciate.\nThe Last Days of the Incas: One of the most entertaining history books on the conquest of the Americas. Kim MacQuarrie provides an excellent narration on the Inca and how they found their demise at the hands of the Spanish conquerors. Surprisingly well balanced, presents a fair account of both sides.\nWho we are and how we got here: This book made me leave momentarily my career on bacterial evolution and switch to phyisical anthropology for a couple of years. David Reich is one of the fathers of the ancient DNA revolution and this is an information dense summary of some of the most important discoveries in the field.\nEconomics in One Lesson: I would struggle to find a book in this list that had a bigger impact on me than this one. Before reading Hazlitt’s work, economics was a field shrouded in strange assumptions that seem to be applied arbitrarily. This book made me understand what economics really is (or should be) about.\nWho’s in charge?: From the scientist who made research on split brain patients popular, this book forces you to reconsider some of the most basic aspects of our perception of the world.\nWhy Nations Fail: The book that got me thinking about how progress occurs. Although now I find Acemoglu and Robinson’s views a bit simplistic, I think Why Nations Fail is a very readable work by anyone that at least points in the right direction and conveys some important messages. It is certainly the best book in the trilogy (Why Nation Fail? - The Narrow Corridor - Power and Progress).\nThe Modern Mind: Peter Watson is one of my favourite authors, I read this book many years ago and is one of the best introductions to the many sides of intellectual history, ranging from art to science, covering economics, philosophy, politics and an endless stream of authors and thinkers.\nThe Origins of Woke: An excellent explanation of the origin of one of the most damaging ideologies of our time. The emphasis is put on legislation and not so much on the philosophy: by trying to enforce with agencies and laws the ideas of Martin Luther King, the state ended up accomplishing the opposite of what it intended to do.\nHow the World Really Works: If you are interested in knowing how the world works, this is a good starting point. Vaclav Smil focuses on the main sources of material and energy that underpin our civilization.\nThe Armchair Economist: A jewell of a book, that taught me to see the world with an open mind and that economics mysteries are everywhere. I love the neat description of economics in 3 words (people follow incentives), the defense of a priori knowledge in the field and his criticism of modern environmentalism.\nDefending the Undefendable: A modern classic in which various people and professions (like the blackmailer, the pimp, the prostitute) who are normally stigmatized, are in fact contributing in a way or another to a good society. You do not have to agree with all arguments to appreciate the fiercely contrarianism and love for freedom of Walter Block\nThe Elephant in the Brain: Robin Hanson and Kevin Simler put together this absolute no-bullshit guide to psychology that describes how good humans are at hiding from themselves the real reasons of their behaviour.\nThe Origins of Political Order A monumental work from Fukuyama, summarizing the evolution of politics in different parts of the world. It has a second part that I have not read yet. There is a lot of information to be digested very slowly, covering the political evolution of civilizations as different as China, India or the Ottoman Empire.\nThe Scout Mindset: This is the book I normally recommend to people who could end up being good rationalists. There is barely a better introduction to it. The Sequences is just too harsh and too nerdy. Julia’s words resonate with a much larger audience.\nSex, Science and Profits: A terrible title and a very disorganized book. Geez, even the subtitle is bad and misleading: Why humans evolved to make money. And yet, it is full of interesting anecdotes and I think that the core thesis of the book (that public funding is not accelerating progress) is correct.\nGuns, Germs and Steel: A book that has received in my opinion too much negative criticism from many sides; the main ideas are essentially correct and Diamond does make a great work at integrating many different sources of information to provide one of the most readable big history accounts written in the last decades.\nThe Statues that Walked: If you are fascinated by the archaeology of Easter Island, as it is my case, this book is a good starting point.\nThe Evolution of Everything: Matt Ridley covers a wide range of separate topics and offers a refreshing libertarian view of progress and science.\nMedieval horizons: Why the Middle Ages Matter: The middle ages is obviously a terrible name product of bad historiography. Although many are already familiar with this, Ian Mortimer does a great job at explaining why the middle ages were not that boring time when nothing happened and instead a period of many societal and technological changes that still resonate in our days\nImagined communities: If Economics in One Lesson changed me forever in economics, Benedict Anderson did the same in politics. After reading this I realized that I had been living in a dream and I had to wake up to the transparent ideology I was surrounded with.\nThe Enigma of Reason: This is the book that made me change my mind (again) on human rationality. For the longest time I just operated on the framework proposed by Kahneman (Thinking fast and slow). Now I think that Hugo Mercier presents a more convincing explanation on the strange behaviours that we humans do.\nBlueprint: For some reason, most people I know (even scientists) still think that most traits are mostly environmental. This is the book I point out to them when I want them to reconsider.\nChimpanzee politics: Some people think of specific politicians or parties, when they think about politics. Well, that’s the wrong approach. The same way that economics is not “about money”, politics is not necessarily about this or that other party. Politics is a universal field that appears when you have multiple agents competing for power. Chimpanzee politics is useful to understand that humans are not that special, not even socially; and that chimpanzees are incredibly brutal and sophisticated at creating coalitions.\nInca Apocalypse: To be read in combination with Kim MacQuarrie’s book. This is the more scholar version about the fall of the Inca Empire. It summarizes the results of decades of bibliography and provides a well balanced account of the Inca Empire, with a systematic comparison with the Spanish Empire that ended up submitting it. I found the description of Spanish mythology particularly interesting. A good starting point to understand “narratives”.\nThe French Revolution &amp; What Went Wrong: It is no secret that the French Revolution is one of my favourite topics. This book excels at presenting this time of history mostly from the point of view of Louis XVI, explaining at great lengths the events that led to the disastrous events that took place in Paris at the end of the 18th century. It made me very compassionate towards the monarchy and understand that real efforts were made to prevent catastrophe.\nOrder without design: Human beings have a terrible bias that make them find intentional agents behind any complex structure. This book dispels the myth that the complexity of cities is (or has to be) the product of a single all-knowing agent. Cities that ignore markets will become just bad places to live in.\nBernoulli’s Fallacy: It contains an interesting summary of the development of statistics and probability ideas, and a fierce attack to the frequentist approach to statistics.\nTriumph of the City Urbanism is incredible interesting: it connects with art, history, economics, moral dilemmas… This book seems to me like a great introduction to the topic.\nHow the World Became Rich: A superb summary on all the theories that analyze the reasons why we had sustained economic growth for the last 200 years. A very good departure point for studies on development and a very valuable guide to discover other books exploring the topic.\nA Brief History of Intelligence: This is an impressive book, in both ambition and breadth. The author describes in great detail how brains have evolved and how the machine learning algorithm that are becoming more and more powerful these days are very often solving problems that had already been solved by nature. Fascinating.\nThe Coddling of the American Mind: This is the book I would recommend to someone who wants to understand the damage that some of the most popular ideas in recent times are doing to society. The three ideas are: “what does not kill you makes you weaker”, “us against them” and “always trust your feelings”.\nThe World Until Yesterday: Jared Diamond’s very personal description of different traditional societies around the world. It starts (in normal Diamond’s style) a bit slow with some personal anecdotes but then becomes a very interesting “big anthropology” overview of the diversity of human cultures.\nThe Sequences / Rationality: From AI to Zombies: Yudkowsky has become lately more well known to a broad public due to his very vocal position on AI. But before that, I knew him as the author of a wonderful collection of blog posts that were wildly creative, arrogant and enlightening; it is almost impossible to read the Sequences and not suffer a major shift in your attitude towards understanding the world. This book, with all its flaws, had a great influence on me.\nThe $12 Million Stuffed Shark: I struggled for years to understand modern art. I did try by reading other books such as “What are you seeing”. Then I had a realization: Modern art is not something to be understood from the inside, but from the outside. Read about economics and psychology and you will be better served than with any review from the most eloquent art critic.\nBuilding the Skyline: The Birth and Growth of Manhattan’s Skyscrapers: A very detailed description on how Manhattan went from just a normal place with swamps, grass and forest, and became one of the most interesting places in the world (yes, I am a big fan of Manhattan).\nThe Road to Serfdom: Hayek is one my personal heroes. The most misunderstood of all of them. So going to the original sources is essential. If you do, you discover a Classical Liberal in the tradition of David Hume, allergic to dogmatism and surprisingly compassionate.\nPhilosophy of Science: Very Short Introduction: A Very Short Introduction: It is obviously “very short”, but still does not disappoint. Samir Okasha is a very interesting character whose books on the Price Equation and Agents are on my shelves waiting to be read.\nHistoria del Pensamiento (colección completa) de Jesús Mosterín: Sadly, it remains untranslated to English. The Historial del Pensamiento de Mosterín is a monumental work on the history of philosophy, including Chinese and Indian philosophies. I appreciate the no-bullshit straightforward approach of Mosterín.\nThe Art of Happiness by Epicurus: Epicurus is one of the most influential thinkers in history… Or he was for a while. That might not be our perception in this specific time in history, only because history was rewritten with the advent of Christianity and most of Epicurus manuscripts were lost. These are the only 4 surviving letters from him, and they are all worth reading.\nHeresy: Jesus Christ and the other Sons of God: The uniformity of beliefs in Christianity is just the product of rewriting history. Much before the nation-states did this, the Catholic church was already perfecting the art. Heresy is about those beliefs that existed in the first centuries after Christ and how they were silenced and (almost) erased from the collective memory.\nLos peligros de la moralidad: Only in Spanish so far (sadly). An excellent exposition of what makes morality dangerous. It is probably the best book I have read on the topic. It introduced me with some more recent ideas in the field such as the Dyadic morality theory, which seems to me more convincing than the theory of moral flavors. To be read in combination with “The Righteous Mind” and “The Identity Trap”.\nSeeing like a State: I do not think it is particularly well written and I tend not to agree with some of the mechanism that Professor James Scott uses to explain the behavior and failures of the states. However, I think it still contains valuable examples and stories about how top-down solutions to human problems are mostly harmful.\nSurely you are joking Mr. Feynman: A biography of Richard P. Feynman, another of my personal heroes. I aspire to be as alive and full of curiosity as him.\nThinking PhysicsThis book is marvelous. Is is possible to understand physics without using equations? Just by developing an intuitive understanding by thinking about many different problems on the world? This book contains just that, a collection of problems that require no math. The problems are complex, but all of them can be solved by just thinking about it. This book is much more enjoyable to read with someone, and solve the problems for hours, without looking at the solutions.\nThe Vital Question: Nick Lane does a great job at making metabolism a field that can be understood and not simply memorized. Biochemistry teachers across all high-schools and universities should read this and take note. They seem to have forgotten the Dobzhansky’s principle: Nothing in biology makes sense except in the light of evolution”\nThe Pillow Book - A very moving book, written by a Japanese lady that served the Empress around the year 1000 in the Court of Kyoto. This is her diary in which she narrates her most intimate life, with all the intrigues, the lovers, the competitions with other ladies. In spite of the 1000 years distance, her worries and thoughts feel so relatable that it seems it was written yesterday.\nThe Last LectureThis is a very moving book, written by a professor of computer science who received a fatal cancer diagnosis and had very few months to live. It is full of wisdom and motivation to go act now. Sad but important.\n"},"Lists/Books-read-in-2026":{"slug":"Lists/Books-read-in-2026","filePath":"Lists/Books read in 2026.md","title":"Books read in 2026","links":[],"tags":["culture","lists"],"content":"Books I have been reading this year\n\n\nLa Guerra Civil (graphic novel) by Paul Preston y José Pablo García. (3.5). Very readable introduction to a very complex topic. The graphic novel format makes it more digestible. This book is a very good exposition of the many agents and parties that played a role in the Spanish Civil War, with a very large Orthodox bias.\n\n\nThe war of art by Steven Pressfield (2) - Self-help, very easy to read. The main message is that in any creative enterprise, the most important thing is to defeat the “ressistance”, that force that compels us to find excuses and postpone our goals. I would put this book in the category of low-quality self-help, a lot of motivational words and little of content. Ignorable\n\n\nOwning the Earth  by Andro Linklater (2.5/5) – This is the most significant work by historian Andro Linklater, offering an all-encompassing narrative of our ideas on land ownership and their social consequences. The book’s primary flaw is its ambition. By attempting to compress the history of all eras and civilizations, the narrative feels “jumpy” at times. I understand it is difficult to strike a balance between breadth and readability, but Linklater’s work occupies a middle ground that I find unconvincing. I would have preferred either a longer, better-narrated historical context for the different eras, or a shorter version focusing on specific periods that delved deeper into the mechanics of why land ownership is so vital. I read through pages of anecdotes and characters with the constant feeling that there was a deeper point just out of reach. In the final section, the author launches into a long diatribe against Austrian economic ideas, presenting an uncharitable vision of Hayek and Mises that no one familiar with their work would recognize. While I appreciate that the criticism doesn’t come from the “usual suspects,” it falls flat because it mostly straw-manning the positions of the Austrian school. Ultimately, I did gain something from the book, but not necessarily from the content itself, but because it forced me to clarify my own positions.\n\n\nTruth by Simon Blackburn (1.5) -  A short book by philosopher Simon Blackburn, on the different positions of the meaning of Truth. I read this by recommendation of my friend Jose Blanca who has read much more on the topic. Knowing Jose and the fact we share our low tolerance for bullshit, I suspect that this must be among the most clearly written introductions to this area by philosophers. Sadly enough, this was still not enough: I found the writing style unnecessarily contorted and the content not especially enlightening.\n\n\nWhy Politics Fails? by Ben W. Ansell (1) - One of the books I should have abandoned instead of finishing. A pop political science book about different aspects of politics, namely: democracy, equality, solidarity, security and prosperity. I was already familiar with the ideas discussed and I did not gain anything new. Moreover, I thought the discussion was full of platitudes. The content is devoid of interest. I could make a longer review if I thought it was worthwhile but is not. Take just as example the finishing lines of the section on democracy:\n“Democracy is ultimately about opinions. Learning how to express our own effectively and to tolerate those of other people is the only way we’ll ever reach consensus. We will always disagree in general. But we will need to agree, in the end, on something”. If this sounds in general “confused” to you, most of the book reads like this.\n\n"},"Lists/Some-great-movies":{"slug":"Lists/Some-great-movies","filePath":"Lists/Some great movies.md","title":"100 great movies","links":[],"tags":["culture","lists"],"content":"Made this list some time ago, it is due for an update.\n\nThe Godfather\nA Clockwork Orange\nThe Matrix\nThe Truman Show\nSleuth\nHarold and Maude\nLittle Big Man\nIl Buono, il Brutto, il Cattivo\nThe man who shot Liberty Valance\nPaths of Glory\nWitness for Prosecution\nTo be or not to be\nLes yeux sans visage\nLa vita è bella\nThe Shawshank Redemption\nMisery\nAkira\nThe Princess Bride\nThe Thing (1982)\nAlien (1979)\nBeing there\nRelatos salvajes\nThere’s something about Mary\nThe Big Lebowski\nHable con ella\nAudition\nSpring, summer, fall, winter and spring\nPaper Moon\nInglorious Bastards\nThe Wolf of Wall-Street\nCastaway on the Moon\nThere will be Blood\nFrankenstein (1931)\nThe prestige\nApocalypto\n12 angry men\nThe Silence of the Lambs\nSome like it hot\nButch Cassidy and the Sundance Kid\nThe Texas Chainsaw Massacre\nCinema Paradiso\nThe Beguiled (1971)\nPulp fiction\nBlade Runner\nBlade Runner 2049\nBoogie Nights\nWall-E\nWatchmen\nGet out\nEl día de la Bestia\nFaster Pussycat, kill kill!\nPrisoners\nSafety last\nScott Pilgrim against the World\nWhiplash\nInside out\nHot Fuzz\nBefore Sunrise\nBefore Sunset\nTesis\nTodo sobre mi madre\nAmerican History X\nThe Green Mile\nLe dîner des cons\nLola rennt\nAs good as it gets\nGattaca\nAbre los ojos\nSeven\nIn the name of the father\nTotal Recall\nFull Metal Jacket\nBarry Lyndon\nShowgirls\nThe toxic avenger\nThis is Spinal Tap\nRisky Business\nThe Midnight Express\nRear Window\nWait until dark\nWhat ever happened to Baby Jane?\nLetyat zhuravli\nMuerte de un ciclista\nDial M for murder\nFreaks\nCity Lights\nDogville\nDancer in the dark\nScent of woman\nTerminator\nDead Poets Society\nMy left foot\nWhen Harry met Sally\nNightmare on Elm Street (1984)\nTop Secret\nSpirited Away\nThe Evil Dead\nOne flew over the Cuckoo’s nest\nGroundhog’s day\nMurder on the Orient Express (1974)\n"},"Lists/Things-I-want-to-read":{"slug":"Lists/Things-I-want-to-read","filePath":"Lists/Things I want to read.md","title":"Things I want to read","links":[],"tags":["culture","lists"],"content":"A (non-exhaustive) collection of books and articles that I would like to read at some point. I update this regularly when I get new recommendations. Things that I read since I started compiling this list go at the end of the file.\nPapers\n\nReal Patterns by Daniel C. Dennett - The paper that introduced the concept of Real Patterns, probably a fundamental idea in epistemology and one of the key subjects to discuss in the context of natural kinds, the problem of universals, etc.\nWhy Most Published Research Findings Are FalseOne of the whistleblower papers pre-Replication Crisis era.\nScientific progress is like doing a puzzle, not building a wall\nProcesses and patterns of interaction as units of selection: An introduction to ITSNTS thinking\nIdentifying the Best Approximating Model in Bayesian Phylogenetics: Bayes Factors, Cross-Validation or wAIC? By Nicolas Lartillot\n\nBooks\n\nLos enemigos del comercio\nThe Bourgeois Era trilogy\nThe Oxford History of the French Revolution\nThe Enlightened Economy\nThe Fiat Standard\nRaised to Obey\nThe Fabric of Civilization: How Textiles Made the World\nWomen’s Work: The First 20,000 Years\nA Culture of Growth\nPrivate Truths, Public Lies\nTrust and distrust in organizations\nThe Swerve\nInventing the Renaissance\nThe Revolutionary Temper\nThe New Roman Empire\nViolence and Social Orders\nThe Rise and Fall of Classical Greece\nThe Problem of Political Authority\nThe Invention of Nature\nChina after Mao: The Rise of a Superpower\nA Short History of Chinese Philosophy\nRestless Empire: China and the World since 1750\nForm Follows Finance\nThe Ultimate Hidden Truth of the World\nThe Great Escape: Health, Wealth, and the Origins of Inequality\nThe Embarrassment of Riches: An Interpretation of Dutch Culture in the Golden Age\nThe Price of Altruism: George Price and the Search for the Origins of Kindness\nThe Invention of Power: Popes, Kings, and the Birth of the West\nMoney, Bank, Credit and Economic Cycles\nMan, Economy, and State with Power and Market\nAnarchy, State and Utopia\nRousseau’s Dog: A Tale of Two Philosophers\nA Concise History of Switzerland\nAgents and Goals in Evolution -\nCausality: Philosophical Theory meets Scientific Practice\nThe Logic of Science\nNature’s Metropolis: Chicago and the Great West\nCoertion, Capital and European States\nPor qué se rompió Estados Unidos: Populismo y polarización en la era Trump - Recommended by Isma\n\n\nRead papers\nRead books"},"Lists/Things-I-want-to-watch":{"slug":"Lists/Things-I-want-to-watch","filePath":"Lists/Things I want to watch.md","title":"Things I want to watch","links":[],"tags":["culture"],"content":"A collection of documentaries, movies, youtube videos, etc that I would like to watch at some point. I update this regularly when I get new recommendations. Things that I have watched since I started compiling this list go at the end of the file.\nDocumentaries\n\nTurning point: The bomb and the cold war\nBrian Wilson: Long Promised Road\nThe monk and the gun\n\nMovies\n\nThe dangerous liaisons\nLa nuit de Varennes\nWinstanley A cult movie about the English Revolution\nOgniem i Mieczem - Polish movie about the Ukranian uprising in the Polish-Lithuanian commonwealth\nPotop - During the 1655 war between Protestant Sweden and Catholic Polish-Lithuanian Commonwealth some Polish-Lithuanian nobles side with Swedish king Charles X Gustav while others side with the Polish king Jan Kazimierz.\nAll is lost - Recommended by Shini\n\nSeries\n\nThe Devil’s whore- 4 episodes, a woman in the English Revolution\nSeverance - Recommended by Sergio, Veerle\n\nYouTube\n\nMoai building By Stefan Milo\nFall of Civilizations All the episodes\nHow Your Brain Organizes Information\nthis painting exercise is unreasonably effective…\nLearning algorithm of Biological networks\nLes 10 plus grandes inventions du Moyen-Âge\n\nAlready watched"},"Lists/Youtube-videos-I-like":{"slug":"Lists/Youtube-videos-I-like","filePath":"Lists/Youtube videos I like.md","title":"Youtube videos I like","links":[],"tags":["culture","lists"],"content":"\nHow did the world get so ugly?\nI Wish I Knew this when I Started Acrylic Painting\nSix things I would fix about Music Theory - I would implement every single modification here proposed\nMariló Montero puede decir lo que quiera en TVE How does the Spanish state manipulate the news in the public media? (In Spanish)\nWhat happened to Italy’s Skyscrapers\n"},"Longer-articles/A-comic-of-Polyphemus":{"slug":"Longer-articles/A-comic-of-Polyphemus","filePath":"Longer articles/A comic of Polyphemus.md","title":"A comic of Polyphemus","links":[],"tags":["personal","art","comic","mythology","ai"],"content":"Today I have been doing something I had been waiting to do for a long time: a comic using AI. A few weeks ago I did my first tests and realized that the new advances in AI image generation we have seen in the last months already allow the user to create quite consistent characters and fine control over the content of the images. If everything goes as planned, my  intention is to use the comic format to tell more complicated stories (both of fiction and non-fiction).\nI have to give a talk about the evolution of folklore tales quite soon, in which I wanted to use the example of Polyphemus as a story that has evolved and mutated for thousands of years. My slides would certainly benefit from having images for different parts of the story, so I thought I could kill two birds with one stone and use this as an excuse to work on a comic of the story of Ulysses and Polyphemus. I have been trying and failing for a few good hours and this is what I have learnt so far\nThe 95% trap\nThe AI (I use both Gemini and ChatGPT) makes images that are about 95% there. However, getting the last 5% is incredibly difficult sometimes. For example, I was trying to have a good image of the blinded cyclops trying to find Ulysses, who is hiding below a big black ram. This is what I get:\n\nStyle-wise it is pretty good. I like the color palette and the level of detail. However:\n\nThe size of Ulysses (or the ram) is just wrong. Either you make Ulysses bigger or you make the ram smaller (depending on the scale you want for Polyphemus)\nUlysses is not hanging below the ram\nUlysses was not consistent with the character I was drawing before in other panels\nI do not like the composition of the image. The ram should be heading towards the exit of the cave, along with other goats. Right now he is just standing there with a silly face\n\nYou could think, well, explain those changes, let the AI work its magic and case closed!\nWell, not so fast. So far, what I see happening is:\n\nSome changes are accepted and easily changed. The changes that normally work better are those that imply some minor local correction: e.g. replacing a spear with a torch.\nSome changes are ignored: For some reason, the prompt is accepted, a new image is generated but the instructions are simply ignored and the image looks exactly as before.  I have seen this many times when you want to change significant things in the image, such as the size of an object, the perspective or the composition.\nSometimes most of the instructions are ignored and you get something quite different from what you asked. For example, trying to correct the image above, the next resulting image was:\n\n\nAll right. Here I have Ulysses hanging from the ram, more or less correctly. The size seems to be about ok (though the ram is too large probably). However, Polyphemus is gone! It also ignored my instructions regarding the orientation of the ram (he should be facing the exit). Well, you can just… ask that, correct? That’s what I did: I asked for the ram to be facing the exit and for Polyphemus to be included in the image.\n\nOh geez. Now I have a headless ram, a Polyphemus that has normal eyes, with a bandage over his forehead and who is not even that big. Everything is wrong with this image. As you can see, it really tries to preserve as much as possible from the previous image, in this case, too much.\nIn cases like this, you are tempted to start a new chat window from zero and try again. This might work, but most of the time the same thing happens… you are 95% there, but the missing 5% is wrong, and now it is a different kind of wrong. For example, starting afresh gave me this:\n\nHere the background is strange. I don’t want the boats to be visible in the frame (in fact, I did not mention anything about boats whatsoever!) And if there were, there should be one single boat, not two. The cyclops is not a cyclops anymore, just a big guy with a splash of blood . The size of Ulysses and the ram seems correct, though it is not totally clear to me where his legs are. The composition is also just wrong… The ram seems to be heading in the wrong direction.\nMaybe I should try again from scratch?\n\nI like the style of this one, and it is consistent with other images I had. But again, here we have the problem of the goats facing the interior of the cave. The cyclops has the right size but now he has two eyes. And the legs and hands from Ulysses’ crew, well, they just come from unexpected places. There were many iterations like this and for some reason I could not get exactly what I wanted, so I gave up for the day.\nSketching is the way\nBut not everything was an endless loop of failures. Some tricks did work. This is a sketch I drew in a couple of minutes showing Ulysses holding a torch, facing Polyphemus. As you can see, I am not a great artist, but in my defense, I haven’t drawn in many years. It was an activity I loved as a kid and I did it quite consistently until I was 15 or so, but in the last 20 years I haven’t done it much. Maybe it is time to start again!\n\nFrom this sketch, Gemini was capable of imagining this:\n\nA menacing Polyphemus facing Ulysses\nI did tell him the context, and that was useful because it added some roaming sheep and some pottery. The image is 95% there but the remaining things to correct, the missing 5%, is mostly about local changes.\n\nI wanted Ulysses to wear a specific attire with a cloak, and not a staff. I did not want him to wear a helmet\nI wanted the entrance of the cave to be close by a boulder\n\n\nAs you can see, as the changes are very specific and do not imply big changes in the composition, Gemini was obedient and the modifications were perfect! But we had to go one extra step. The lighting of the cave now does not make sense. So I gave Ulysses a torch and instructed Gemini to adapt the colors to the new lighting conditions. This is the end result:\n\nThe final image on the encounter between Ulysses and Polyphemus\nSometimes, prompting alone works\nSometimes, you do not need to do the sketching, and just describing the image works. I do add previous images I have generated and I like so that the AI can have a reference. For example, I liked this image of Ulysses offering the strong wine to Polyphemus.\nUlysses offering the wine\nCharacter consistency is very good (of course, there are some minor details to improve, but overall I give it a pass). You need to pay close attention to details to notice the differences with the characters in the previous panel.\nAn uncensored pleasant surprise\nUsing ChatGPT I managed to obtain this picture (without using any sketch, just prompting) of Ulysses and his mates shoving the big stake into the cyclops’ giant eye:\n\nThe art-style is different from the one in previous panels, but I did not mind! I suspect I can fix that somehow. I was just very excited to see a scene like this generated by the AI without any stupid censor alarm going off. I am not sure what went wrong but I am glad it happened because this ended up one of the best looking panels of today’s session.  For God’s sake, there are streams of blood pouring out his eye and that was allowed?  Well, I am grateful anyway!\nHowever, I think it was just a stroke of luck. A bit later, trying to generate the cyclopes that come to the entrance of the cave alerted by Polyphemus’ cries of help - Noman has tricked me! - , I obtained this pretty lame picture:\n\nThe art-style is consistent with the style of the violent image but now is drifting too far off the first panels, which are my reference. Also, the cyclopes just look like troglodytes and they have two eyes. They are just big prehistoric men that don’t skip a single day at the gym.\nI did try to correct this by instructing ChatGPT to make them full-blooded cyclopes at the same time he adjusted the style\n\nWhich resulted in this image, which for some reason I just find quite funny. I do not think it is totally bad, but the eyes are disproportionately big, which makes it hilarious for some reason. When I tried to adjust the eye size however, I got a censorship alert:\n“It looks like I’m unable to generate the updated image because this request violates our content policies.”\nDon’t ask me why. Apparently stabbing a big guy in the eye with a stake is ok, but making a cyclops’ eyes smaller is something that our society is not ready for. This was a sign for me to call it a day.\nSome lessons from today\nThe comic is about 50% there. Still requires probably two more sessions (maybe 3). It won’t be perfect by any means, but I will stick to my new motto: better imperfect than unfinished.\nA summary of the things I have learnt so far:\n\nSketching is essential. It saves time in the end\nUse the right tool. Use a laptop for the prompts and image editing, the iPad only for the sketches.\nLocal vs Global. Local changes are ok. Big changes in composition or relative size are not ok\nThe 3-Round rule. If an image requires more than 3 rounds of improving, it is probably because the sketch was not good enough\nCensorship is unpredictable: Sometimes you get lucky, sometimes you get blocked for trivial reasons.\n\nFinishing the comic\n2026-01-20 20:37\nI continued working on the Polyphemus comic and I finished it. Frankly, I could have put a couple of hours more and have something semi-decent, the ending feels rushed and I decided to leave out the very last part of the story (where Ulysses reveals his real name). But, given that the goal was doing this just as a learning exercise, I decided to stop there. I made progress very slowly, but that’s ok.\nTo do this comic I had to learn some very basic concepts in Affinity, which is a tool I haven’t worked with before. The general idea is making the images using AI (Chat GPT, Gemini) and then composing a full comic of several pages in Affinity, where I would also add any needed caption texts. I do see obvious problems with the comic, including mismatches between different panels, missing panels, some inconsistencies, etc. They annoy me but I decide to ignore them and move forward. Did you hear about the difference between what you can produce and your taste? Well, that’s the problem.\nI want to take some minor notes so that I do not forget this simple lessons:\n\nBe structured: You do need to write a script, with information of every panel and the text that goes in each one of them. It seems obvious right? Well, apparently it was not for me this time, and I jumped right into the image generation. So for the next time: be structured!\nBe consistent: Here I am thinking about consistency in terms of style. It is not easy but it is very important. I think that this comic is mostly there but still there are some mismatches between the art style of some of the panels.\nBe organized: I find myself generating a lot of different files: sketches, AI art, Affinity documents. It is important to give them some structure in folders. Use Airdrop to transfer files from the iPad to the Mac.\nWrite the text first: I am doing inversely. I am picturing in my head what images make sense and then writing the text. Text must be written first\nDesign the layout first: Also, it is much easier if I just put the panels with the right size and organization first and then I just add the images\nTransitions are important: I underestimated much the importance of small transition panels. I was focusing too much on great images (such as the one of the Cyclops arriving to the cave, or the one of the Cyclops touching the back of the sheep). The small transitions with different close-ups is what makes the story readable. The comic language seems to be similar to the cinema language.\n\nThe full comic is here:\n"},"Longer-articles/Fundamental-beliefs":{"slug":"Longer-articles/Fundamental-beliefs","filePath":"Longer articles/Fundamental beliefs.md","title":"Fundamental beliefs","links":[],"tags":["philosophy","personal"],"content":"Like most people, I have been part of many discussions over completely different topics. Normally, speaker A states a position, and B disagrees. Then there is an exchange of what reasons are good or not (this is if the conversation does not devolve into an exchange of whataboutism or ad hominem attacks). Speaker A ends with the same position he started with, and the same goes for B. Nothing has changed. From the same observations, people conclude completely different things. However, the interesting thing is this: if we discuss 10 issues that can have a yes or no answer, the number of possible positions is 1024. Yet, in practice, we will see that most people end up answering those 10 questions in a very similar way, resulting in at most 2 or 3 independent positions.\nMany people have noticed this before and multiple explanations have been offered. In my case, I like to talk about fundamental beliefs. These are beliefs that are at the very core of what a person believes about the world. And there are very few of them: for that reason, different people will answer similarly to many possible issues and end up in one of the big ideological clusters.\nWe have many beliefs that are not fundamental and they are all part of a big intricate network. Some of these beliefs are not very central to the network and they can be easily replaced. For example, if I think the neighbor’s name (who I have barely seen) is Tom and then someone corrects me and says it is John, I have absolutely no problem updating my network.\nHowever, some beliefs are very deep in the network, connected to many other beliefs. For instance, if you were trying to convince me that slavery is desirable, I would have a negative reaction because it connects directly with very core fundamental beliefs about what is morally acceptable and what is not. Those are central nodes in the network: a change in them will reverberate all over other beliefs and could trigger (maybe not overnight) a cascade of updating in which the worldview of a person changes substantially.\nWhat are those fundamental beliefs that completely condition our vision of the world? This is a tentative list, made mostly from personal experience, discussion with friends, and inspiration from some relevant books.\n\n\nTrust: We can trust authorities / We must be skeptical of authorities.\n\n\nComplexity: Complexity emerges only from agency / Complexity might arise from decentralized processes.\n\n\nHuman malleability: Humans can be fundamentally changed through culture and education / There is something called human nature.\n\n\nLimited world: Most games are zero-sum games / Not all games are zero-sum games.\n\n\nReason: Reason is an objective tool we can use to find the Truth / Reason is limited; the world is complex and often has no objective solution.\n\n\nMoral Agent: The moral agent is the individual / The moral agent is a collection of individuals (the nation, the family).\n\n\nViolence: The end justifies the means / The end does not justify the means.\n\n\nFairness: Outcomes are more important than processes / Processes are more important than outcomes.\n\n\nSupernatural: The world is not supernatural / The world is supernatural.\n\n\nThe above list with its 9 points is most likely redundant, which makes them most likely correlated with an even more fundamental question. For instance: I think people that believe in Capital-R Reason are much more prone to agree with solutions in which the end justifies the means. These people also tend to believe that humans are malleable, that complexity emerges from agency, and that we need to just trust authorities (the correct ones) to have a perfect society. Maybe these points could be summarized into a single fundamental belief called “bottom-up” vs “top-down”.\nI am aware that these fundamental beliefs are not binary as I represented them. People who do not think that the end justifies the means would still agree if pressed that if the only way to stop a guy about to press a button that destroys the full planet is killing the guy, that this is the right thing to do. People who believe that economics is not zero-sum might accept that some very specific resources do still fall into the limited category. People who think that humans are essentially malleable might think that genetics still plays a role (even if small) to determine human performance. It is all about degrees.\nOver my lifetime I have seen myself changing quite radically many of my beliefs, and every time it happened it did not occur from reading about the topic itself but on how these fundamental questions are answered.\nFor example: when I was 16 my biology teacher introduced me to the ideas of the Club of Rome, a think tank very influential in the 60s, that rang the alarms about overpopulation being one of the major threats that humankind was facing. To me at the time, these ideas made sense. The more people inhabit the planet, the more natural resources we are consuming and the more the planet suffers. What is the obvious solution? Controlling the population increase! If the planet had (e.g.) 10% the amount of people, everyone would become much richer since there would be much more for each head to distribute. Not only that, the smaller amount of humans would make the protection and preservation of nature much easier.\nI carried these ideas with me for the longest time. I would like to add, for an embarrassingly long amount of time. I already had read enough economics to know that the above arguments do not make much sense and that is simply not how things work, but still for some reason did not consciously update quick enough. I eventually did. And it was not so much from reading about this specific topic (overpopulation), but the change came mostly from understanding that economics is not a zero-sum game and that wealth does not come from splitting the current resources. Before that, I am sure I could find very good arguments on why the Club of Rome is correct, because there are good arguments. For any position you can find good reasons and good arguments; that is what humans are made for.\nAnother example. For an also embarrassingly long amount of time, I believed that decentralization in general was a disastrous thing. I clearly remember complaining about the education system in my home country (Spain) and the fact that in the 17 regions there were slightly different versions on how to do things. I found that annoying because, if “there is one correct way of doing things, why would you have to create variants?” I found especially upsetting the fact that different regions had different grading systems, making comparison about regions and standardization more difficult.\nNow I think that my previous position is just wrong. What changed was not that someone explained to me how good the system in Navarra or Catalonia was working (I would have just pointed out, in that case the solution is having “that” system in the whole country). What changed was a fundamental belief in me on the power of reason to design good systems. Over time I understood that society is not a machine that an engineer has to design. And now, since I do not believe that anything like the perfect education system exists, I rather value a system where decentralization allows for the creation and exploration of new alternatives. We shouldn’t aim for one perfect design, but allow different methods to compete so the best solutions can emerge. If anything, now I tend to think that there is absolutely NO decentralization in the education system!\nAll these fundamental beliefs condition our vision of the world. Thomas Sowell spoke about the constrained and unconstrained vision. Jonathan Haidt about the moral flavors. I think these are good explanations, I just don’t think that anyone has got the “final set” yet (clearly I haven’t found it) but understanding that it exists clarifies why Speaker A and Speaker B never agree. They are arguing about the leaves of the tree, while the disagreement is actually in the roots."},"Longer-articles/Science-is-less-deterministic-than-you-might-think":{"slug":"Longer-articles/Science-is-less-deterministic-than-you-might-think","filePath":"Longer articles/Science is less deterministic than you might think.md","title":"Science is less deterministic than you think","links":[],"tags":["papers","science","statistics","philosophy"],"content":"This is a comment on the paper Same data, different analysts\nUnless you have been living under a rock, you know that we are in the midst of what historians may one day call “The Replication Crisis Era”.\nLong story short, starting in the 2000s, some scientists started ringing the alarms that many (if not a majority) of published scientific papers could be inaccurate, misleading, or simply wrong. People started reporting examples of a practice called “p-hacking”, in which the data is “adjusted” until significant p-values start popping out. I am not talking about specific instances of a lone scientist that had committed fraud or simply lied about his results but of a systemic problem that seemed to pervade modern science. In 2015, a landmark paper published in Science (Estimating the reproducibility of Psychological Science) revealed that, after reanalyzing a set of 100 psychology papers from 3 high impact factor journals, fewer than 50% of the papers could be reproduced. Around this time, multiple groups studied this phenomenon and most of the blame was put on the fact that many studies had low sample sizes, making them prone to noise.\nBut years passed and while it is clear that part of the problem has to do with small sample sizes, thinking that the issue is only about data collection depicts a very incomplete picture. The variability is not related to the data alone, but also to how we handle the data. Gould et al. have published an excellent paper illustrating this. The setting is:\nThere are two datasets and one scientific question for each of them:\n\n\n\nThe first is the “blue tit” dataset , which comes from a three-year study of wild birds nesting at Wytham Wood in the UK. It includes information about 3,720 chicks across 452 broods, with information like the weight and tarsus length of nestlings 14 days after hatching, the number of siblings they had, and the size of their parents. The question analysts had to answer was: To what extent is nestling growth influenced by competition with siblings?\n\n\n\n\nThe second is the “Eucalyptus” dataset, derived from the Bush Returns program in Victoria, Australia. It consists of 351 quadrants surveyed across 18 different sites. Researchers were interested in reforestation on private land, and the specific question for analysts was: How does grass cover influence Eucalyptus spp. seedling recruitment?\n\n\n\nIt is important to note that both datasets involved experimental interventions, not just passive observation. In the bird study, researchers performed “cross-fostering” (moving chicks between nests to artificially enlarge or reduce brood sizes). This allowed them to isolate the effect of sibling competition from genetic factors. In the Eucalyptus study, the intervention was the removal of livestock grazing to see if the canopy would regenerate naturally. I highlight this because some people could argue that the problem is not so much about reproducibility but about observational vs interventional studies in general.\nNow, the impressive part is this: The researchers recruited a massive group of 246 analysts across 173 teams to investigate these questions. Not only this, they also found a very large group of reviewers that evaluated the reliability of the statistical methods (without seeing the results) of each analysis. To make the results comparable, each analyst team was required to report a standardized effect size that would summarize how strong the effect was (and the direction).\nThe results?\nJudge for yourself:\n\nFigure 2 from the paper, which captures the main results\nTo simplify, what we are seeing is:\n\nEvery horizontal line represents a different analysis from a different analyst group.\nThe x-axis is the “strength” of the correlation between (A) growth and competition from siblings, (B) number of seedlings and percentage of grass.\n\nIn other words, values to the left suggest a negative relation, while values to the right suggest a positive relation. For A, most studies find a negative relation, though the magnitude changes substantially for many of them. For B, the results are more balanced; some find a very negative relation while others find a clear positive signal.\nSo, how does this bode for the replicability of science? Remember, we are dealing with an almost perfect scenario where everyone has access to the same dataset! Some friends of mine saw this and thought the glass was half full: at least in the birds dataset, most teams seem to recover a negative relation, though for the Eucalyptus it is less clear. For me, the glass is half empty. It is true that in the birds there was a clear majority in one direction, but the magnitude of the effect seems to vary almost continuously across a wide range of values. And in the Eucalyptus case, the values seem to be all over the place!\nThere also seemed to be very little consensus among reviewers about what constituted a good scientific approach! Some reviewers would classify one paper as “Publishable as it is” while others would call it “Unpublishable”. When removing those papers that had received marks of “Unpublishable” and “Major Revisions”, the remaining analyses still seemed not to agree on their conclusions. Similar results also happened when the analyses coming from people who had no self-identified expertise in statistics were removed.\nSo the obvious question once might ask is, where does the variability come from? Well, it seems to stem from the fact that seemingly clear scientific questions are instead pretty vague and can be translated into numbers in many different ways. Maybe an example clarifies this: let’s say that we want to measure growth (in the example of the birds). What do we use as a proxy? The weight? Or the size of the legs? Or should we combine both into a single variable? Should both have the same importance? Or should the importance be weighted? Another factor to consider is: what do we do with outliers? Traditional teaching says that in some cases they should be removed. But another solution is using statistical methods (such as non-parametric testing) that are more robust to outliers. Or should we include them (or some of them?) because they are in fact the observations containing the most information? Any of these solutions is perfectly defensible in isolation, but a proper statistical analysis can contain many of these questions that can be answered in different ways, leading in the end to quite different results.\nNow, what should we conclude from this? I am not sure there is a single lesson from this paper, but it does provide some bits to update our posterior towards a region of more skepticism in general with scientific papers. I already try to be very selective with what I read because most papers are just a waste of time. To me It goes without saying, but I do not think we need to throw our hands up in despair and become postmodernists. Science has a very good track record of discovering truths and producing an accurate map of the world that surrounds us. But, believing blindly in the powers of peer-review and statistical analyses as many science fanboys do, it is equally mistaken. I was aware of this, this is an extra point in that direction.\nThe questions that scientists analyzed in this study were totally aseptic (or as close as they can be). Most people will not care about whether grass is more or less important for the growth of Eucalyptus. Now, if this is the level of disagreement we find in a neutral topic with a perfect dataset, should we be surprised when, in controversial topics such as the impact of the minimum wage on the labor market, people obtain contradictory results? I was swayed by reading Bernoulli’s fallacy to believe that a large part of the problem is our very flawed box of statistical tools. Although I still believe that a more widespread use of Bayesian analysis would remove some of the constant pernicious problems that keep bugging us, now I see that the problem is also in the intrinsic “vagueness” of the world around us and this is not leaving us at any point soon."},"Longer-articles/Simulating-an-alien-fauna":{"slug":"Longer-articles/Simulating-an-alien-fauna","filePath":"Longer articles/Simulating an alien fauna.md","title":"Simulating an Alien Fauna","links":[],"tags":["phylogenetics"],"content":"For the past few days, I have been simulating a population of “aliens” to create original teaching materials for an upcoming phylogenetics workshop. While I initially considered using the classic Caminalcules (a group of imaginary creatures created by the evolutionary biologist Joseph H. Camin in the 1960s) I decided to develop a dataset from scratch. To me, using an artificial dataset has at least two distinct pedagogical advantages:\n\nNeutrality: Students cannot rely on prior biological knowledge, forcing them to focus strictly on character traits and data.\nGround Truth: As the creator, I have access to the “true” evolutionary history, including exact divergence times, fossil ages, and ancestral states.\n\nMy goal is to provide a modern framework for exploring parsimony, likelihood, and Bayesian inference, techniques that have mostly developed in the field of phylogenetics after the original Caminalcules were conceived. My “aliens” remain nameless for now, but I hope that after some feedback from the workshop we can come up together with something suitable\n\nOne of my alien creatures\nIInitially, I intended to generate the dataset exclusively through simulation. However, I realized that balancing a didactic, easy-to-analyze dataset with a fully automated pipeline would require several additional weeks of work. I ended up moving to a hybrid approach, simulating parts of my dataset and manually curating others. I did take the time to make something that was general enough so that I could possibly reuse it in a more ambitious setting or expanded into a proper scientific tool.\nCoding (Phylosim)\nThe Github repository is here\nThe tool itself is a collection of scripts (temporarily named Phylosim) with 3 main modes:\n\n\nT : To simulate species trees\nThe simulator produces phylogenetic trees using a birth death process (so, forward in time).  The idea that fossils “mostly” belong to extinct diversity that branches off the extant diversity is an important concept that for some reason is hard to grasp (even for reviewers of scientific publications, as I sadly had the opportunity to experience firsthand).\n\n\nE: To simulate the evolution of traits\nOn top of the species tree, you simulate the evolution of traits. I wrote two probabilistic models: the first one was to simulate discrete characters using Markov Chains.  The user can define his own model, including as many states as he desires and different transition rates (in the same time units as the species tree). The second one was a model of Brownian evolution for continuous characters.\n\n\nA: To manually add specific evolutionary events\nThis is an additional function that would allow me to pinpoint a specific branch and a specific point within the branch to add a trait. All species descendant from that point inherit that trait. Multiple traits can be added (creating nested evolution). This is the part where most of the manual curation happens.\n\n\nOnce the simulator was ready, I simulated a dataset of about 100 species, including extinct lineages. The resulting table was something as follow:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNode in the Species TreeBodyMouthEyesColor RColor GColor Bn1010120140100n2111909590n312220120150\nSome of the traits were simulated with the E mode: the eyes were simulated using a discrete Markov Chain. The colors were simulated using 3 independent variables that evolved following a Brownian motion. The other traits were controlled manually to create an example of evolution that was suitable for the classroom.\nArt\nIt is much more fun to work with something visual. For that reason, I decided to create sprites for the different aliens. I had some help here! My sister did the drawings in Procreate using her iPad. We divided the aliens into multiple parts that could be easily combined:\n\nThe challenge here was making all parts compatible, meaning that any head could fit any antenna, any body would match any side appendix, etc. Once we have about 5 or 6 sprites for each body part, the rest was a matter of combining them. I wrote a simple Python script that would take every row of the table with the different traits and combine them into a single image. The original images were all of them grayscale: the color variables that had evolved were incorporated by applying a tint to the images. These were some of the creatures resulting from this procedure:\n\nCreatures of an alien fauna\nPreparing the material\nI took all the images and rendered them using Gemini into a photorealistic image. The prompt I used was:\n\nA photorealistic 3D render of the creature in the image, preserving all its features. The shot is a macro photograph on a solid white background with professional studio lighting. The skin is insect-like. Be as close as you can to the original image”\n\nI thought of including also different textures as variables to evolve, such as slimy, hairy or spiky, but for the sake of simplicity did not go that way\n\nI sampled 23 leaves from the simulated tree and added 7 fossils. I was strategic with the sampling, trying to cover most of the interesting diversity we had generated and avoiding species that were too similar to each other. Fossils were sampled from extinct lineages (at the end of the branch, an even better option would have been sampling somewhere before the extinction). Since the tree is measured in time units, I gave the different fossils an age.\nFor the sake of simplicity, I also changed the name of the species that were sampled (the simulator uses n1, n2, n3, etc to name the different nodes of the tree) to letters of the latin alphabet for extant organism and greek letters for fossil ones. Using a package I wrote to plot trees (Phylustrator) I also generated phylogenies for the full tree, the extant tree and the sampled tree. Everything is in the Github repository in the form of Jupyter notebooks.\nThe sampled tree, including the images of the common ancestors all over the tree. It includes also the timeline on the left\nI spent quite a while putting all the images together in a document using Affinity (in hindsight, I should have also written a script for this). I made two PDFs, one with the original renders and another one with the photorealistic images.\n\nThe original renders\nI printed the resulting images into photographic paper. I tried two sizes, A4 and A3. In A4 the figures are too small and important details are lost, such as the number of eyes. However, the figures in the A3 are a little too big. The idea is that the students put all the leaves of the tree along the border of a big white cardboard and they draw the phylogeny.\nDiscussing the evolution of traits\nIt really helps to use these figures in which the different parts are represented with different colors. Using Phylustrator it is easy to generate these plots that indicate with small squares the points of transition from one body to another body.\n\nIn the exercise, the students need to recognize that the aliens have multiple parts and that these parts are homologous. Some of them are very easy to notice: the body shape, the side appendices, the tails, etc. By comparing them it is relatively easy at least to identify the major groups in the exercise (WKLH, NUSM, etc). The challenging part is (I think!) to reconstruct the deeper relationships between the groups.\nThere is one trait that is misleading on purpose: the eyes. The eyes evolve in the tree using the next model:\n\nEyes evolution\nThe rate of change was set high enough to see multiple transitions across the tree. Due to the high rate of change, eyes (in isolation) are not a good trait to recover the phylogeny. There are a lot of cases of convergent evolution all over. The changes can be visualized in the next phylogeny:\nEvolution of eyes in the phylogeny\nSome pedagogical observations\nI am planning to use the evolution of eyes to explain how probabilities are computed in a phylogeny, both forward for simulation and “backwards”, for likelihood inference. Many possibilities stem from here, from explaining the different parts of probability models to Felsenstein’s pruning algorithm. My goal is not a highly mathematical description of these ideas but a clear explanation that shows, first and foremost, to show the problems that scientists face when inferring phylogenies. I think very often lecturers spend way too much time focusing mostly on the techniques and algorithms that people have found to approach different challenges and not enough time to present the students the problems themselves. In my opinion, the correct thing to do is to invert the time devoted to each part: much more emphasis should be put on presenting the problems before they are given any solutions whatsoever."},"Photos/01.2026":{"slug":"Photos/01.2026","filePath":"Photos/01.2026.md","title":"01.2026","links":[],"tags":[],"content":"I bought a Fujifilm X100VI for Christmas. Normally I am a Sony shooter (Sony A7RIII), I have been very happy with my camera since I bought it in 2018. However, when I take pictures is always “a thing” that happens: because the lenses are big and the camera is relatively heavy and cumbersome, it is not something I carry with me on a daily basis. Also, I normally shoot raw, take time to put the photos in the computer, edit them in Lightroom, etc. Then, I had the idea of buying the new Fuji that so many good critics has received, mostly because it fits my jacket pocket and I can take it with me easily everywhere.\n\n\n\n\n\n"},"Random-thoughts/Are-species-natural-kinds":{"slug":"Random-thoughts/Are-species-natural-kinds","filePath":"Random thoughts/Are species natural kinds?.md","title":"Are species natural kinds?","links":[],"tags":["philosophy","phylogenetics","short"],"content":"I have always considered that species are natural kinds and organisms merely instances of a general class. However, I recently learned about the Ghiselin-Hull thesis and now I am not so certain. First I had to overcome some initial skepticism with their argument due to what I consider a poor choice of terminology (I am not a fan of using the term individuals as they do). After some reflection I think they are mostly correct and it is inaccurate to consider species as natural kinds. The mental experiment that convinced me is this: if we found a tiger on Mars, with the same stripes, claws, jaws and the same DNA as tigers on Earth, but had evolved independently by perfect convergent evolution, would we say that the tiger belongs to the same species that an Earth tiger? Most likely not. If tigers were instances of a class the answer would be yes.\nRight now my epistemological position can be summarized in the following points.\n\nRealism is correct. There are structures and processes in the real world (in the territory).\nThose processes might create objects that share similarities.\nPrototype theory is essentially correct; we classify objects into fuzzy categories based on similarities and differences.\nGold as a category refers to something in the real world. Species also refer to something in the real world. Both are valid categories.\nGold and species are different types of structures, the first one is the result as a static property of the universe, the second one is the result of many processes over time.\nIt makes sense to move the discussion beyond natural kinds vs artificial kinds and start talking about Dennett’s Real Patterns. Species might not be natural kinds in the traditional sense but they are Dennett Patterns (same for gold).\n\nFollowing some recommendations by Gemini, I put a couple of books on my Amazon basket about this topic. One is The Species Problem: A Philosophical Analysis by Richard A. Richards. The second one is Natural Categories and Human Kinds by Muhammad Ali Khalidi. It would be interesting to see if reading them substantially changes my vision of the world."},"Random-thoughts/Risks-of-Cultural-Abundance":{"slug":"Random-thoughts/Risks-of-Cultural-Abundance","filePath":"Random thoughts/Risks of Cultural Abundance.md","title":"Risks of Cultural Abundance","links":[],"tags":["culture","philosophy","personal","short"],"content":"We live in a time with endless opportunities to consume all sorts of cultural products.\nMovies, series, documentaries, books, comics, blogs, you name it. With the advent of AI, I expect the cultural production of our world will only increase. In such a world, there are at least two challenges that I think are worth considering at a personal level:\n\n\nChoosing what to consume. It is too easy to consume whatever they are showing on Netflix, a random book with a catchy title that just became popular this year or a YouTube channel that puts some interesting content every day. Very often, we just slide into certain cultural spheres without realizing it. I would like to be agentic about this and decide consciously what I consume and what I do not. Even if I live until I am 100 years old, the amount of content I will be able to absorb is just a microscopic fraction of all the work created out there by all sorts of people across time and geography. For that reason, I think it is worth making that tiny fraction the best of the very best. I have always tried, but I think it is good to have a reminder to continue to strive.\n\n\nThe temptation to only consume. It is too easy to just want to consume culture. It is easy to be under the impression that everything worth saying, reading or watching has already been put forward by someone, somewhere. I do think this is mostly true. However, I could bet that most content creators who made anything at all started producing culture that they did not believe was worth paying attention to: they just did it in spite of certain embarrassment about the quality of their work. Also, I am a firm believer that the only way to improve at something is just doing the damn thing.\nMy teacher Jose Maria told me not long ago that I am an explorer, but only an explorer of the worlds that other people have created. This was undoubtedly a valid criticism and one worth listening to, so I decided to shut up, listen to his advice and do something about it. That something is this blog.\n\n"},"Random-thoughts/debugging":{"slug":"Random-thoughts/debugging","filePath":"Random thoughts/debugging.md","title":"Debugging the Plot","links":[],"tags":[],"content":"Testing the Graph\nBelow this line, you should see a scatter plot.\n\n"},"Random-thoughts/test":{"slug":"Random-thoughts/test","filePath":"Random thoughts/test.md","title":"test","links":[],"tags":[],"content":"testing this\n\n"},"index":{"slug":"index","filePath":"index.md","title":"index","links":[],"tags":[],"content":"Welcome to Weak Priors\nThis is a place to share some thoughts. At the moment, this place is under active construction."}}